#include <arduino.h>
#include "defs.h"
U8G2_SSD1306_128X32_UNIVISION_2_HW_I2C u8g2(U8G2_R0, /* reset=*/U8X8_PIN_NONE); //SSD1306  0.96寸OLED
//U8G2_SSD1316_128X32_2_HW_I2C u8g2(U8G2_R0,/* reset=*/ U8X8_PIN_NONE);             //SSD1316  0.87寸OLED
//T12及温度相关
boolean t12_switch = 0;        //T12加热开关
boolean t12_heat_on_start = 0; //是否开机就加热？ 0-否 1-是

float t12_ad = 0.0;           //T12即时ADC值
int16_t t12_temp = 0;         //T12即时温度
int16_t t12_temp_display = 0; //T12显示温度

boolean t12_error = 0;     //手柄未接提示
boolean t12_adc_error = 0; //温度超出测量范围
int16_t set_temp_max;      //自动计算设置的温度最大值
int16_t set_temp_min;      //自动计算设置的温度最小值

int16_t t12_temp_average_cache = 0;    //记录采集温度，缓存用
int16_t t12_temp_average = 0;          //8次内采集到的平均温度，显示用
uint8_t t12_temp_average_count = 0;    //平均温度采集计数
boolean buzzer_temp_average_state = 0; //到达温度提示声

//float tc1047_ad = 0.0;      //tc1047ADC值
float tc1047_temp = 0.0;  //tc1047温度，机内温度
int8_t tc1047_refer = 20; //T12环境参考温度校准值

float vcc_refer = 4.93; //参考电压，稳压芯片输出的电压是多少就填多少
float vin = 0.0;        //电源电压
float vin_refer = 0.0;  //输入电压校准值
float vin_low = 3.3;    //低压报警阈值
boolean vin_error = 0;  //低压报警提示

uint32_t vin_read_time = 0;        //定时读取输入电压时间
uint32_t t12_temp_read_time = 450; //定时T12温度采样时间

boolean buzzer_state = 0;          //蜂鸣器准备状态
uint16_t buzzer_time;              //蜂鸣器响的时间
uint16_t buzzer_count;             //蜂鸣器响的次数
boolean buzzer_settings_state = 0; //进入设置界面的长音状态
boolean buzzer_zjm_state = 0;      //退出至主界面的长音状态

boolean zjm_sleep_ts = 0;  //主界面休眠提示  0-无 1-休眠中
uint16_t sleep_time = 150; //进入休眠的时间阈值,单位秒
uint8_t sleep_temp = 200;  //休眠时的温度，单位摄氏度
boolean sleep_state = 0;   //休眠引脚状态 0低电平 1高电平

uint16_t sleep_temp_cache = 0; //休眠前的温度缓存

uint8_t oled_ld = 50;     //OLED亮度
boolean oled_fx = 0;      //OLED方向 0-不旋转，横向显示 1-旋转180度
boolean xzbmq_fx = 0;     //编码器方向 0-顺加逆减 1-顺减逆加
boolean hfccsz_state = 0; //恢复出厂设置 0-NO 1-YES

boolean xp_state = 0; //息屏状态 0-无 1-息屏
int8_t xp_x = 0;      //息屏随机变化位置X
int8_t xp_y = 0;      //息屏随机变化位置Y
int8_t xp_x_old = 50; //上一次息屏随机变化位置X
int8_t xp_y_old = 21; //上一次息屏随机变化位置Y

uint16_t sz_temp[4] = {36, 224, 347, 446}; //深圳头曲线拟合的4段温度   Y 391倍
//uint16_t sz_temp[4] = {43, 259, 382, 490};   //深圳头曲线拟合的4段温度   Y 331倍
//uint16_t sz_temp[4] = {49, 262, 391, 486}; //深圳头曲线拟合的4段温度   Y    1.03版本程序移植
float sz_p[4]; //深圳头曲线拟合的4个系数   P
//********** 菜单标志位相关 **********

uint8_t display_count = 1; //默认要显示的界面
boolean dec_state = 0;     //小数点输入状态 0关闭 1开启
uint8_t qj_ca_count = 0;   //全局长按计数

boolean settings_kxxk_L = 0;    //设置界面空心选框 顺时针转
boolean settings_kxxk_R = 0;    //设置界面空心选框 逆时针转
int8_t settings_kxxk_count = 0; //设置界面空心选框

int8_t pidSettings_kxxk_count = 0; //pid界面空心选框
int8_t pidSettings_sxxk_count = 0; //pid界面实心选框

int8_t sleepSettings_kxxk_count = 0; //pid界面空心选框
int8_t sleepSettings_sxxk_count = 0; //pid界面实心选框

int8_t oledSettings_kxxk_count = 0; //oled界面空心选框
int8_t oledSettings_sxxk_count = 0; //oled界面实心选框

int8_t powerSettings_kxxk_count = 0; //电源设置界面空心选框
int8_t powerSettings_sxxk_count = 0; //电源设置界面实心选框

int8_t settings_pwm_kxxk_count = 0; //PWM界面空心选框
int8_t settings_pwm_sxxk_count = 0; //PWM界面实心选框

int8_t t12Settings_kxxk_count = 0; //烙铁头设置界面空心选框
int8_t t12Settings_sxxk_count = 0; //烙铁头设置界面实心选框

int8_t calibrationSettings_kxxk_count = 0; //烙铁头设置界面空心选框
int8_t calibrationSettings_sxxk_count = 0; //烙铁头设置界面实心选框
//********** 动态调参PID **********
float p = 25.0; //比例系数
float i = 8.7;  //积分系数
float d = 2.6;  //微分系数

uint16_t set_temp = 320;          //设置温度
int16_t thisError = 0;            //本次误差
int16_t thisError_average = 0;    //累积误差的平均值
int16_t lasterror = 0;            //前一拍偏差
int16_t preerror = 0;             //前两拍偏差
const int8_t deadband = 0;        //死区
int16_t pid_out = 0.0;            //PID控制器计算结果
uint8_t pid_out_bfb = 0.0;        //输出值0-100%
const float pwm_max = 2047.0;     //输出值上限
const float pwm_min = 0.0;        //输出值下限
const float errorabsmax = 2000.0; //偏差绝对值最大值
const float errorabsmin = 50.0;   //偏差绝对值最小值
const float alpha = 0.2;          //不完全微分系数
float deltadiff = 0.0;            //微分增量

//********** 画主界面 **********
uint8_t zjm_x1 = 0;
uint8_t zjm_x2 = 100;
boolean zjm_dh_run = 0;    //主界面动画状态 0-不允许 1-允许
uint32_t zjm_dh_time1 = 0; //动画1运转对比时间
uint32_t zjm_dh_time2 = 0; //动画2运转对比时间
//热、停切换动画变量
uint8_t zjm_dh_x1 = 0;
uint8_t zjm_dh_y1 = 0;
uint8_t zjm_dh_r1 = 1;
//pwm动效动画
uint8_t zjm_dh_l[14];
//开机过度动画y增量
int8_t zjm_dh_y = 32;

uint16_t last_move_time = 0;
uint16_t screen_saver_past = 0;
uint16_t time_past = 0;

uint32_t error_buzzer_db_time = 0;

float vin_cache = 0.0;
uint8_t vin_cache_count = 0;

float tc1047_cache = 0.0;
uint8_t tc1047_cache_count = 0;
//时间平均滤波的采样次数 采样周期 = 采样次数*定时执行任务的时间
uint8_t t12_adc_error_count = 0; //t12ADC超出检测范围错误计数

uint32_t system_sleep_db_time = 0; //系统进入睡眠对比时间

int16_t settings_dh_x[6] = {0, 50, 100, 150, 200, 250};
int16_t settings_dh_x_count = 0; //设置界面动画x增量记录

uint8_t auto_get; //自动刷写eeprom的状态存储，判断是否首次开机 0-首次 1-非首次

const uint8_t chinese_t12[1591] U8G2_FONT_SECTION("chinese_t12") =
    "A\0\3\2\4\4\2\4\5\14\14\0\377\11\375\12\376\0\0\0\0\0\337 \5\0\242\5+\13w\346"
    "]\134\33\206,\256\1-\6\26\362\305\1.\6\42c\305\20\60\13\226\342\315\220\204~L\206\4\61\11"
    "\225\242\305\330O\203\0\62\13\226\342\315\220\204b_\207\1\63\16\226\342\315\220\204iiN\305dH\0"
    "\64\17\226\342\235\226D]\262$K\206\61M\0\65\16\226\342\305!M\7\71M\305dH\0\66\17\226"
    "\342\315\220\204j\262h\242\61\31\22\0\67\13\226\342\305\61\15\323bZ\3\70\17\226\342\315\220\204\306d"
    "HBc\62$\0\71\17\226\342\315\220\204\306dPS\61\31\22\0D\15\227\42\306 \205I\352c\62"
    "H\0I\10\223\42\305\22\365eP\14\226\342\305\240\204\216\303\222V\1S\17\226\342\315\220\204j<\304"
    "\251\230\14\11\0V\17\227\42FjM\262(\253\204I\32g\0\0\0\0\4\377\377!\3\27\271_O"
    "\16$\321T\13s Gr$Gr(G\262t\1N\256\34\314^w:\274\245\351\60\344\224\341\240"
    "\344P\22\15R\230\345@\26\207Q\42\17O\21\35\314^_\35\310\342\60N\206!\22+\331\232\255Q"
    "R\214\222b\22\325\264R\30\2ON\33\314^_*&C\32U\243\242TK\242a\210Z\243j\324"
    "KS\64I\35P\134\35\314^_\35\10\323d\30\244\34\223\206\245\24f\311\60HI\34E\303\226v"
    "\333\0P\177\37\314^_\22\325\242\244\226V\206AQb%\32\266\34L\206A\12\343\254e\30\244j"
    "\0Qs\31\313^WZ\313\201$\35\316\71\226\16\7\65\207\222\34\310\322\222\16\10Q\267\34\314^w"
    "\232\252Y\24Fa(eR\230&\303\20\351@V\12C\265\216f\0Q\306\42\314^G\230\244Y\24"
    "&\311\60dI\224&R\32\15\213\26\205\331\60eQ\230Ea\66\14i\14R\240$\314^_\16\346"
    "\310\60$C\26%Q\26%Q\26%Q\26%Q-\211jITK\242$L\6M*S\213\33\314"
    "^\327p\210r\260\34\306a\234\14C\26\306a\22\226\252Q\65\214\206\3T\21\32\312_g\216\304\303"
    "AGtD\32\42\251$\225\244!\322\21\71\321\201\4T&\31\273^\307\203\250#\255QI\313\324\60"
    "\32\206\60\15\323p\30\302\64\2W\372\31\313^_m\70h\345A\316\342A\316\262\341 \65)\203\242"
    "\246\303A\134O\35\314^\327p\313\201l\270%a\251:\34\242\326\250:\34\222,\12\243\254\24f\0"
    "^U\34\313^_m\70h\325a\10\323p\30\302$\213\206\203\324\64\34\244\306(\221\0^\246\36\314"
    "^\77\20\17\207\250\26\16\207\250\26F\203\230\203\311\60dQVL\302p\213\266\1_\0\34\314^\317"
    "pH\263\34\310r \313\201,\33\36\263\34\310\342\60\16\323b\234\1bK\30\313^\367\20\15:\226"
    "c\361p\316\261t\70\250\71\226#u(\6b\245!\314^W\64lQ\230Ea\62Lb\224#\321"
    "\260)\245dJ\242,J\212Q-\211\222Zfc\245\37\314^WZ\32\206(\253\14R\22F\303\20"
    "\245\251\62\34\302(+\205\241\226\204I\226\31e\271\27\314^o\216\246\303c\16\346\340\60\207i\307\70"
    "\13\223,\16\1e\313\42\314^W\230\3Y\70<e\71\260\14S\222E\225\326\244\62$QR\214\222"
    "b\244hQ\22\15\1e\366\34\314^\77\24\15iT\215\242\341\20\245\321\220dQ\377\65\32\322\250\226"
    "\344X\6f/\33\314^\337\60\207\361\60\207\361\260S\206\347\34\211\206\64\312\201\244\252\15C\0g*"
    "\30\313^o\216\305\303\71\307\322\341\240\346\320\16$\325\250\244ej\12g:!\314^W\16fC\230"
    "E\321\240Da\26eSM)U\232*Y\24FY\22\325\222(\11\7g\304\36\314^W\16F\303"
    "\20\245\331\360\324I\211*\226\212\22%\25%\322\244jT\215\212\2h!\33\314^W\30\247\245\341%"
    "\12\263\232\222&J\251\322T\11\325\306$\214\64\1n)!\314^O\66\210Q\226\3\203T\311*\311"
    " FY\230\203\311\60$R\322Ti\252\64%\303\1n\220%\314^O\64\14R\222\345@\24f\311"
    " U\262J\62hI\255\222\14\212\224\205I\224\224\222RE\211\244\0p\331\42\314^W\226\3\331\240"
    "%\265$Q\232\222\64K\302$L\66)\33\264\246$\312\242\312\240\244Y\2p\355!\314^W\226\3"
    "Y:$\203\230E\241\42E[\24FI\213\22E:\234D\265\250%\213*\0u\65\31\313_g\216"
    "\305\303)+e\245\341\224\225\262\322p\11\323\60M\207\1w &\314^\357\260\14I\230DI\230D"
    "\311\260\14I\224EI\224E\311pP\242,J\242,J\262dP\64\265\0z\357 \314^O\234F"
    "\245A\211\252\303 \345P\222\14CR\213\243a\210*MCR\331\222\326P\177n\33\314^\317p\210"
    ":\15\207\70\36\36sh\30\304\70\34\244\60\33\302\70\32\36\210e\27\314^O\234\326\6-\16\323T"
    "L\262$\32#\245\26U\373\15\213f\35\314^\317\260\244Q\64$\303\322\247\60\351\64\34t\312\60\344"
    "\264aH\253\303\20\1\217l\35\314^W\332\66(\203\26\246I\226&\311\360\222#\321 \216\311\220%"
    "i\250\226\0\217\307\37\314^O\16\204q\230\14\203\16\345@\26mQ\230Ea\34V\302\64Lr$"
    "\33\6\1\220\6 \314^OV\314\222\64\31\6\35\310\221\250\262D\265d\30\262$\252\205q\26'\345"
    "l\30\4\221\315\32\313^\77\240\15;\224\16\7\251q\30\302\250\70\14\71\20\17\347t\70\10\224\301\34"
    "\314^O\34V\302!\251\245\203\62Li\323\360\226\206I\230DI(e\245\64\225\364!\313^O\64"
    "\14Q\16\350\220\64HR\26IY$\15\222\224ER\26I\203\244\3\211\216$\0\230z\33\314^O"
    "\226\14J[\245\24&\225A\351\226\364\377\377\377\24FI\61\311\2\0";
